/*描述
石头剪刀布是常见的猜拳游戏。石头胜剪刀，剪刀胜布，布胜石头。如果两个人出拳一样，则不分胜负。

一天，小A和小B正好在玩石头剪刀布。已知他们的出拳都是有周期性规律的，比如：“石头-布-石头-剪刀-
石头-布-石头-剪刀……”，就是以“石头-布-石头-剪刀”为周期不断循环的。请问，小A和小B比了N轮之后，
谁赢的轮数多？

输入
输入包含三行。
第一行包含三个整数：N，NA，NB分别表示比了N轮，小A出拳的周期长度，小B出拳的周期长度0 <N,NA,NB< 100。
第二行包含NA个整数，表示小A出拳的规律。
第三行包含NB个整数，表示小B出拳的规律。
其中，0表示“石头”，2表示“剪刀”，5表示“布”。相邻两个整数之间用单个空格隔开。
输出
输出一行，如果小A赢的轮数多，输出A；如果小B赢的轮数多，输出B；如果两人打平，输出draw。*/
#include <stdio.h>
#define MAXN 1000+7
int a[MAXN],b[MAXN];
int main()
{
	int i,n,len_1,len_2,count_1=0,count_2=0;
	scanf("%d %d %d",&n,&len_1,&len_2);
	for(i=0;i<len_1;i++)scanf("%d",&a[i]);
	for(i=0;i<len_2;i++)scanf("%d",&b[i]);
	for(i=0;i<n;i++)
	{
		int p1=a[i%len_1],p2=b[i%len_2];
		if((p1==0&&p2==2)||(p1==2&&p2==5)||(p1==5&&p2==0))count_1++;
		else if((p1==0&&p2==5)||(p1==2&&p2==0)||(p1==5&&p2==2))count_2++;
	}
	if(count_1==count_2)printf("draw\n");
	else printf("%s\n",count_1>count_2?"A":"B");
	return 0;
}
